[
    {
        "title": "The merits of using Ethereum MainNet as a Coordination Blockchain for\n  Ethereum Private Sidechains",
        "authors": [
            "Peter Robinson"
        ],
        "year": 2019,
        "abstract": "A Coordination Blockchain is a blockchain with the task of coordinating\nactivities of multiple private blockchains. This paper discusses the pros and\ncons of using Ethereum MainNet, the public Ethereum blockchain, as a\nCoordination Blockchain. The requirements Ethereum MainNet needs to fulfil to\nperform this role are discussed within the context of Ethereum Private\nSidechains, a private blockchain technology which allows many blockchains to be\noperated in parallel, and allows atomic crosschain transactions to execute\nacross blockchains. Ethereum MainNet is a permissionless network which aims to\noffer strong authenticity, integrity, and non-repudiation properties, that\nincentivises good behaviour using crypto economics. This paper demonstrates\nthat Ethereum MainNet does deliver these properties. It then provides a\ncomprehensive review of the features of Ethereum Private Sidechains, with a\nfocus on the potential usage of Coordination Blockchains for these features.\nFinally, the merits of using Ethereum MainNet as a Coordination Blockchain are\nassessed. For Ethereum Private Sidechains, we found that Ethereum MainNet is\nbest suited to storing long term static data that needs to be widely available,\nsuch as the Ethereum Registration Authority information. However, due to\nEthereum MainNet's probabilistic finality, it is not well suited to information\nthat needs to be available and acted upon immediately, such as the Sidechain\nPublic Keys and Atomic Crosschain Transaction state information that need to be\naccessible prior to the first atomic crosschain transaction being issued on a\nsidechain. Although this paper examined the use of Ethereum MainNet as a\nCoordination Blockchain within reference to Ethereum Private Sidechains, the\ndiscussions and observations of the typical tasks a Coordination blockchain may\nbe expected to perform are applicable more widely to any multi-blockchain\nsystem.",
        "techniques": [],
        "url": "http://arxiv.org/abs/1906.04421v2"
    },
    {
        "title": "Stateful to Stateless: Modelling Stateless Ethereum",
        "authors": [
            "Sandra Johnson",
            "David Hyland-Wood",
            "Anders L Madsen",
            "Kerrie Mengersen"
        ],
        "year": 2022,
        "abstract": "The concept of 'Stateless Ethereum' was conceived with the primary aim of\nmitigating Ethereum's unbounded state growth. The key facilitator of Stateless\nEthereum is through the introduction of 'witnesses' into the ecosystem. The\nchanges and potential consequences that these additional data packets pose on\nthe network need to be identified and analysed to ensure that the Ethereum\necosystem can continue operating securely and efficiently. In this paper we\npropose a Bayesian Network model, a probabilistic graphical modelling approach,\nto capture the key factors and their interactions in Ethereum mainnet, the\npublic Ethereum blockchain, focussing on the changes being introduced by\nStateless Ethereum to estimate the health of the resulting Ethereum ecosystem.\nWe use a mixture of empirical data and expert knowledge, where data are\nunavailable, to quantify the model. Based on the data and expert knowledge\navailable to use at the time of modelling, the Ethereum ecosystem is expected\nto remain healthy following the introduction of Stateless Ethereum.",
        "techniques": [],
        "url": "http://arxiv.org/abs/2203.12435v1"
    },
    {
        "title": "Does Money Laundering on Ethereum Have Traditional Traits?",
        "authors": [
            "Qishuang Fu",
            "Dan Lin",
            "Yiyue Cao",
            "Jiajing Wu"
        ],
        "year": 2023,
        "abstract": "As the largest blockchain platform that supports smart contracts, Ethereum\nhas developed with an incredible speed. Yet due to the anonymity of blockchain,\nthe popularity of Ethereum has fostered the emergence of various illegal\nactivities and money laundering by converting ill-gotten funds to cash. In the\ntraditional money laundering scenario, researchers have uncovered the prevalent\ntraits of money laundering. However, since money laundering on Ethereum is an\nemerging means, little is known about money laundering on Ethereum. To fill the\ngap, in this paper, we conduct an in-depth study on Ethereum money laundering\nnetworks through the lens of a representative security event on \\textit{Upbit\nExchange} to explore whether money laundering on Ethereum has traditional\ntraits. Specifically, we construct a money laundering network on Ethereum by\ncrawling the transaction records of \\textit{Upbit Hack}. Then, we present five\nquestions based on the traditional traits of money laundering networks. By\nleveraging network analysis, we characterize the money laundering network on\nEthereum and answer these questions. In the end, we summarize the findings of\nmoney laundering networks on Ethereum, which lay the groundwork for money\nlaundering detection on Ethereum.",
        "techniques": [],
        "url": "http://arxiv.org/abs/2303.15841v1"
    },
    {
        "title": "TopoShot: Uncovering Ethereum's Network Topology Leveraging Replacement\n  Transactions",
        "authors": [
            "Kai Li",
            "Yuzhe Tang",
            "Jiaqi Chen",
            "Yibo Wang",
            "Xianghong Liu"
        ],
        "year": 2021,
        "abstract": "Ethereum relies on a peer-to-peer overlay network to propagate information.\nThe knowledge of Ethereum network topology holds the key to understanding\nEthereum's security, availability, and user anonymity. From a measurement\nperspective, an Ethereum network's topology is routing-table information hidden\ninside individual Ethereum nodes, measuring which poses challenges and remains\nan open research problem in the existing literature.\n  This paper presents TopoShot, a new method uniquely repurposing Ethereum's\ntransaction replacement/eviction policies for topology measurement. TopoShot\ncan be configured to support Geth, Parity, and other major Ethereum clients. As\nvalidated on local nodes, TopoShot achieves 100% measurement precision and high\nrecall 88% - 97%. To efficiently measure the large Ethereum networks in the\nwild, we propose a non-trivial schedule to run pair-wise measurements in\nparallel. To enable ethical measurement on Ethereum mainnet, we propose\nworkload-adaptive configurations of TopoShot to minimize the service\ninterruption to target nodes/network.\n  We systematically measure a variety of Ethereum networks and obtain new\nknowledge including the full-network topology in major testnets (Ropsten,\nRinkeby and Goerli) and critical sub-network topology in the mainnet. The\nresults on testnets show interesting graph-theoretic properties, such as all\ntestnets exhibit graph modularity significantly lower than random graphs,\nimplying resilience to network partitions. The mainnet results show biased\nneighbor selection strategies adopted by critical Ethereum services such as\nmining pools and transaction relays, implying a degree of centralization in\nreal Ethereum networks.",
        "techniques": [],
        "url": "http://arxiv.org/abs/2109.14794v1"
    },
    {
        "title": "DEthna: Accurate Ethereum Network Topology Discovery with Marked\n  Transactions",
        "authors": [
            "Chonghe Zhao",
            "Yipeng Zhou",
            "Shengli Zhang",
            "Taotao Wang",
            "Quan Z. Sheng",
            "Song Guo"
        ],
        "year": 2024,
        "abstract": "In Ethereum, the ledger exchanges messages along an underlying Peer-to-Peer\n(P2P) network to reach consistency. Understanding the underlying network\ntopology of Ethereum is crucial for network optimization, security and\nscalability. However, the accurate discovery of Ethereum network topology is\nnon-trivial due to its deliberately designed security mechanism. Consequently,\nexisting measuring schemes cannot accurately infer the Ethereum network\ntopology with a low cost. To address this challenge, we propose the Distributed\nEthereum Network Analyzer (DEthna) tool, which can accurately and efficiently\nmeasure the Ethereum network topology. In DEthna, a novel parallel measurement\nmodel is proposed that can generate marked transactions to infer link\nconnections based on the transaction replacement and propagation mechanism in\nEthereum. Moreover, a workload offloading scheme is designed so that DEthna can\nbe deployed on multiple distributed probing nodes so as to measure a\nlarge-scale Ethereum network at a low cost. We run DEthna on Goerli (the most\npopular Ethereum test network) to evaluate its capability in discovering\nnetwork topology. The experimental results demonstrate that DEthna\nsignificantly outperforms the state-of-the-art baselines. Based on DEthna, we\nfurther analyze characteristics of the Ethereum network revealing that there\nexist more than 50% low-degree Ethereum nodes that weaken the network\nrobustness.",
        "techniques": [],
        "url": "http://arxiv.org/abs/2402.03881v2"
    }
]